In [1]:
import pandas as pd

In [5]:
data_file_path = './dataSet.csv'

In [6]:
datafile_df = pd.read_csv(data_file_path,index_col='id')

In [7]:
datafile_df.head()

   First Name Last Name Gender   Amount
id
1        Todd     Lopez      M   8067.7
2      Joshua     White      M   7330.1
3        Mary     Lewis      F  16335.0
4       Emily     Burns      F  12460.8
5   Christina    Romero      F  15271.9

In [10]:
datafile_df[['First Name','Amount']]

      First Name   Amount
id
1           Todd   8067.7
2         Joshua   7330.1
3           Mary  16335.0
4          Emily  12460.8
5      Christina  15271.9
...          ...      ...
996        Paula  17868.5
997        Paula  15182.9
998       Thomas   3720.7
999   Jacqueline  10824.6
1000     Deborah   6090.7

[1000 rows x 2 columns]

In [11]:
type(datafile_df[['First Name','Amount']])

pandas.core.frame.DataFrame

In [12]:
datafile_df.describe()

             Amount
count   1000.000000
mean   10051.323600
std     5831.230806
min        3.400000
25%     4854.875000
50%    10318.050000
75%    15117.425000
max    19987.400000

In [13]:
datafile_df.dtypes

First Name     object
Last Name      object
Gender         object
Amount        float64
dtype: object

In [14]:
datafile_df.mean()

Amount    10051.3236
dtype: float64

In [15]:
datafile_df['Amount'].mean()

10051.323600000002

In [16]:
datafile_df.values

array([['Todd', 'Lopez', 'M', 8067.7],
       ['Joshua', 'White', 'M', 7330.1],
       ['Mary', 'Lewis', 'F', 16335.0],
       ...,
       ['Thomas', 'Andrews', 'M', 3720.7],
       ['Jacqueline', 'Moreno', 'F', 10824.6],
       ['Deborah', 'Young', 'F', 6090.7]], dtype=object)

In [17]:
datafile_df['Amount'] / 1000

id
1        8.0677
2        7.3301
3       16.3350
4       12.4608
5       15.2719
         ...
996     17.8685
997     15.1829
998      3.7207
999     10.8246
1000     6.0907
Name: Amount, Length: 1000, dtype: float64

In [21]:
def add_one(someNumber):
  someNumber = someNumber + 1
  return someNumber

In [22]:
datafile_df['Amount'].apply(add_one)

id
1        8068.7
2        7331.1
3       16336.0
4       12461.8
5       15272.9
         ...
996     17869.5
997     15183.9
998      3721.7
999     10825.6
1000     6091.7
Name: Amount, Length: 1000, dtype: float64